# Напишите алгоритм, заполняющий список произвольными целыми числами
# в диапазоне от -100 до 100. В списке должно быть n - элементов.
# Подсказка:
# для получения случайного числа используйте функцию randint() модуля random
import random
numbers = []
qty = 201

for number in range(qty):
    numbers.insert(0, random.randint(-100, 100))
print(numbers)
